Repository: HenryJobst/django_lowcoder
Catalog: project/locale/*/LC_MESSAGES/django.po
Languages: de

source: Project Settings
de: Projekteinstellungen

source: Import File
de: Datei importieren

source: Save
de: Speichern

source: Cancel
de: Abbrechen

source: Are you really shure to delete the project <b>%(name)s</b>?
de: Sind Sie sicher, das Sie das Projekt <b>%(name)s</b> löschen wollen?

source: Confirm
de: Bestätigen

source: Contact a administrator to register at least one cookiecutter code template.
de: Wenden Sie sich bitte an einen Administrator zur Einrichtung mindestens eines Cookiecutter Code-Templates.

source: URI or Path to an existing cookiecutter code template.
de: URI oder Pfad zu einem existierenden Cookiecutter Code-Template.

source: Deployment Type
de: Auslieferungstyp

source: Generate Project
de: Projekt generieren

source: Project settings
de: Projekteinstellungen

source: Table
de: Tabelle

source: Main Table
de: Haupttabelle

source: Are you really shure to delete the table <b>%(name)s</b>?
de: Sind Sie sicher, das Sie die Tabelle <b>%(name)s</b> löschen wollen?

source: Column
de: Spalte

source: Save & Edit Next
de: Speichern & Nächste Spalte bearbeiten

source: Are you really shure to delete the column <b>%(name)s</b>?
de: Sind Sie sicher, das Sie die Spalte <b>%(name)s</b> löschen wollen?

source: File
de: Datei

source: Select a file for import.
de: Wählen Sie eine Datei für den Import

source: Are you really shure to delete the file <b>%(name)s</b>?
de: Sind Sie sicher, das Sie die Datei <b>%(name)s</b> löschen wollen?

source: Import Settings
de: Importeinstellungen

source: Table Section
de: Auswahlbereich

source: Head
de: Kopf

source: Tail
de: Fuß

source: Table Head
de: Tabellenkopf

source: Row for the table header (0-based)
de: Zeile für den Tabellenkopf

source: Table section (form: 'A:E' or 'A,C,E:F' - empty: all columns)
de: Tabellenbereich (Form: 'A:E' oder 'A,C,E:F' - leer: alle Spalten)

source: Row Count
de: Zeilenanzahl

source: Count of rows (empty: all rows until table end)
de: Anzahl der Zeilen (leer: alle Zeilen bis zum Ende der Tabelle)

source: Skipped Rows at the Beginning
de: Übersprungene Zeilen am Beginn der Tabelle

source: Number of skipped rows at the beginning of the table (empty: skip no rows)
de: Anzahl der übersprungenen Zeilen am Beginn der Tabelle (leer: keine Zeilen überspringen)

source: Skipped Rows at the End
de: Übersprungene Zeilen am Ende

source: Number of skipped rows an the end of the table (0: skip no rows)
de: Anzahl der übersprungenen Zeilen am Ende der Tabelle (0: keine Zeilen überspringen)

source: Count of Rows
de: Anzahl der Zeilen

source: User data
de: Benutzerdaten

source: Register
de: Registrieren

source: Login
de: Anmelden

source: Lost password?
de: Passwort zurücksetzen

source: created at
de: Erzeugt

source: updated at
de: Aktualisiert

source: Programming Language
de: Programmiersprache

source: Programming Languages
de: Programmiersprachen

source: programming language
de: Programmiersprache

source: Programming Language: %(name)s
de: Programmiersprache: %(name)s

source: path
de: Pfad

source: Java JPA Entities
de: Java JPA Entitäten

source: Python Django Models
de: Python Django Modelle

source: model exporter type
de: Datenmodel-Export-Typ

source: Code Template Parameters
de: Code-Template-Parameter

source: value
de: Wert

source: Project: %(user)s - %(project)s
de: Benutzer: %(user)s - Projekt: %(project)s

source: user
de: Benutzer

source: description
de: Beschreibung

source: project
de: Projekt

source: projects
de: Projekte

source: Ensure this value has at least %(limit_value)d character (it has %(show_value)d).
de: Stellen sie sicher, das der eingebene Wert mindestens %(limit_value)d Zeichen hat (momentan %(show_value)d Zeichen).

source: project settings
de: Projekteinstellungen

source: domain
de: Domäne

source: admin user name
de: Administrator Benutzername

source: admin user password
de: Administrator Passwort

source: admin user email
de: Administrator Benutzername

source: demo user name
de: Demo-Benutzer Benutzername

source: demo user password
de: Demo-Benutzer Passwort

source: Set no password to disable creation of a demo user!
de: Kein Passwort setzen um die Erzeugung eines Benutzers zu deaktivieren!

source: docker root
de: Docker Name

source: deployed archive
de: Exportiertes Archiv

source: file
de: Datei

source: files
de: Dateien

source: transformation mapping
de: Transformationszuordnung

source: sheet
de: Arbeitsblatt

source: headline
de: Kopfzeile

source: model
de: Tabelle

source: models
de: Tabellen

source: main entry
de: Haupt-Tabelle

source: index
de: Reihenfolge

source: exclude from creation
de: von der Erzeugung ausschließen

source: %(model_name)'s %(field_labels) are not unique.
de: Die Kombination aus %(model_name) und %(field_labels) muss eindeutig sein.

source: Table: %(user)s - %(project)s - %(model)s
de: Tablelle: %(user)s - %(project)s - %(model)s

source: field
de: Spalte

source: fields
de: Spalte

source: None
de: Nichts

source: (Unknown)
de: (Unbekannt)

source: transformation column
de: Tranformationsspalte

source: table
de: Tabelle

source: data type
de: Datentyp

source: field length
de: Feldlänge

source: decimal number length
de: Anzahl der Gesamtstellen einer Dezimalzahl

source: decimal places
de: Anzahl der Nachkommastellen einer Dezimalzahl

source: default value
de: Standardwert

source: selection values
de: Auswahlwerte

source: allow empty values in form
de: Leereintrag im Formular zulässig

source: allow empty values in database
de: Leereintrag in der Datenbank zulässig

source: foreign key
de: Fremdschlüssel

source: unique
de: Eindeutig

source: create index
de: Indizieren

source: validation pattern
de: Prüfmuster

source: show in list page
de: in Listenansicht anzeigen

source: show in detail page
de: in Detailansicht anzeigen

source: internationalizable
de: internationalisierbar

source: Column: %(user)s - %(project)s - %(model)s - %(column)s
de: Spalte: %(user)s - %(project)s - %(model)s - %(column)s

source: Suffix %(suffix) is not allowed for import
de: Die Dateiendung %(suffix) ist für den Import unzulässig.

source: Invalid mapping for Code Template: %(ct)s, Parameter: %(param_name)s Value: %(param_value)s
de: Ungültiges Mapping im Code-Template: %(ct)s, Parameter: %(param_name)s Wert: %(param_value)s

source: No mapping found for Code Template: %(ct)s, Parameter: %(param_name)s Value: %(param_value)s
de: Kein passendes Mapping zum Parameterwert gefunden im Code-Template: %(ct)s, Parameter: %(param_name)s Wert: %(param_value)s

source: Local Directory
de: Lokales Verzeichnis

source: No ModelExpander class for the given programming language available! Contact support for further help.
de: Es ist für das ausgewählte Code-Template noch kein passender Datenmodel-Export verfügbar. Bitte wenden Sie sich an den Support.

source: Error
de: Fehler

source: Access forbidden (Error: 403)
de: Zugriff verboten (Fehler: 404)

source: You are not allowed to request this page.
de: Sie sind nicht berechtigt, auf die angeforderte Seite zuzugreifen.

source: Django-LowCoder: Application generation out of excel or csv tables
de: Django-LowCoder: Anwendungsgenerierung aus Excel- oder CSV-Tabellen

source: Logout
de: Abmelden

source: Projects
de: Projekte

source: Settings
de: Einstellungen

source: Files
de: Dateien

source: Tables
de: Tabellen

source: Administrator site
de: Administrationsseite

source: Loading...
de: Lade...

source: Columns (%(length)s)
de: Spalten (%(length)s)

source: Create new field
de: Neue Spalte anlegen

source: Index
de: Reihenfolge

source: Unique
de: Eindeutig

source: Indexed
de: Indexunterstützung

source: Data Type
de: Datentyp

source: Field Length
de: Feldlänge

source: Default Value
de: Standardwert

source: Actions
de: Aktionen

source: Edit
de: Editieren

source: Delete
de: Löschen

source: Up
de: Hoch

source: Down
de: Runter

source: No columns present yet.
de: Es sind noch keine Spalten vorhanden.

source: Columns: %(length)s
de: Spalten (%(length)s)

source: Main Table: %(icon)s
de: Haupttabelle: %(icon)s

source: Order: %(index)s
de: Reihenfolge: %(index)s

source: Created at: %(created)s
de: Erzeugt: %(created)s

source: Last modified at: %(updated)s
de: Aktualisiert: %(updated)s

source: List
de: Liste

source: Tables (%(length)s)
de: Tabellen (%(length)s)

source: Create new model
de: Neues Model anlegen

source: Columns
de: Spalten

source: Order
de: Reihenfolge

source: Select
de: Auswählen

source: No tables present yet.
de: Es sind noch keine Tabellen vorhanden.

source: Description: %(desc)s
de: Beschreibung: %(desc)s

source: Tables: %(length)s
de: Tabellen: %(length)s

source: Created at: %(created)s
de: Erzeugt: %(created)s

source: Administrator User Name: %(adminname)s
de: Administrator Benutzername: %(adminname)s

source: Administrator Password: %(adminpw)s
de: Administrator Passwort: %(adminpw)s

source: Demo User Name: %(demoname)s
de: Demo-Benutzer Benutzername: %(demoname)s

source: Demo User Password: %(pw)s
de: Demo-Benutzer Passwort: %(pw)s

source: Domain: %(domain)s
de: Domäne: %(domain)s

source: Code Template: %(ct)s
de: Code-Templates: %(ct)s

source: Projects (%(length)s)
de: Projekte (%(length)s)

source: Create new project
de: Neues Projekt anlegen

source: Description
de: Beschreibung

source: Created at
de: Erzeugt

source: Updated at
de: Aktualisiert

source: Generate
de: Generieren

source: No projects present yet.
de: Es sind noch keine Projekte vorhanden.

source: Files (%(length)s)
de: Dateien (%(length)s)

source: Create new file
de: Neue Datei hinzufügen

source: Sheets
de: Arbeitsblätter

source: No files present yet.
de: Es sind noch keine Dateien vorhanden.

source: Logged out!
de: Ausgeloggt!

source: Click here, to login again.
de: Klicke hier, für die erneute Anmeldung.

source: The password was successfully resetted!
de: Das Passwort wurde erfolgreich zurückgesetzt!

source: Login again?
de: Erneut anmelden?

source: Please, input your new password as confirmation.
de: Bitte geben sie das neue Passwort zur Bestätigung ein.

source: New password:
de: Neues Passwort:

source: Confirm password:
de: Passwort bestätigen:

source: Change password
de: Passwort ändern

source: Passwort reset failed.
de: Rücksetzen des Passworts fehlgeschlagen.

source: Reset password
de: Passwort zurücksetzen

source: Django-LowCoder - Register
de: Django-LowCoder - Registrieren

source: Your generated project is here: %(link)s
de: Das erzeugte Projekt ist hier: %(link)s
